Revit 2027 API
ColorFillSchemeEntry.CanSetValue(ElementId) Method
 Checks whether StorageType of entry is ElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSetValue(
	ElementId value
)
Public Function CanSetValue (
	value As ElementId
) As Boolean
public:
bool CanSetValue(
	ElementId^ value
)
member CanSetValue :
        value : ElementId -> bool
Parameters
value ElementId
 New ElementId value.
Return Value
Boolean
 True if StorageType of the entry is ElementId and the entry, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillSchemeEntry Class
CanSetValue Overload
Autodesk.Revit.DB Namespace